; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v12)
             (pred_10 ?v11 ?v7)
             (pred_1 ?v6 ?v7)
             (pred_8 ?v1 ?v6 )
	     (pred_2 ?v6)
             (pred_12 ?v10)
             (pred_5 ?v11)
             (pred_7 ?v7)
             (pred_9 ?v6)
             (pred_11 ?v11)
             (pred_4 ?v6)
             (pred_6 ))



(:action op_4
:parameters (?v5 ?v3 ?v4 ?v13)
:precondition (and (pred_12 ?v5) (pred_12 ?v3) (pred_5 ?v4) (pred_7 ?v13)
          (pred_3 ?v5 ?v3) (pred_10 ?v4 ?v13)
                   (pred_1 ?v3 ?v13) (pred_2 ?v5) 
                   (pred_9 ?v3) (pred_11 ?v4))
:effect (and  (pred_4 ?v3) (not (pred_9 ?v3))))


(:action op_5
:parameters (?v5 ?v8)
:precondition (and (pred_12 ?v5) (pred_12 ?v8)
               (pred_2 ?v5) (pred_3 ?v5 ?v8) (pred_4 ?v8))
:effect (and (pred_2 ?v8) (not (pred_2 ?v5))))

(:action op_2
:parameters (?v5 ?v4)
:precondition (and (pred_12 ?v5) (pred_5 ?v4) 
                  (pred_2 ?v5) (pred_8 ?v4 ?v5) (pred_6 ))
:effect (and (pred_11 ?v4)
   (not (pred_8 ?v4 ?v5)) (not (pred_6 ))))


(:action op_3
:parameters (?v5 ?v9 ?v2)
:precondition (and (pred_12 ?v5) (pred_5 ?v9) (pred_5 ?v2)
                  (pred_2 ?v5) (pred_11 ?v2) (pred_8 ?v9 ?v5))
:effect (and (pred_11 ?v9) (pred_8 ?v2 ?v5)
        (not (pred_11 ?v2)) (not (pred_8 ?v9 ?v5))))

(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_12 ?v5) (pred_5 ?v4) 
                  (pred_2 ?v5) (pred_11 ?v4))
:effect (and (pred_6 ) (pred_8 ?v4 ?v5) (not (pred_11 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_08 obj_11 obj_16 obj_31 obj_15 obj_30 obj_14 obj_13 obj_07 obj_18 obj_12 obj_26 obj_10 obj_06 obj_03 obj_09 obj_27 obj_19 obj_20 obj_22 obj_05 obj_17 obj_01 obj_24
    obj_02 obj_04 obj_29
    obj_21 obj_25 obj_23
    )

    (:init
       (pred_6)

       (pred_12 obj_28)
       (pred_12 obj_08)
       (pred_12 obj_11)
       (pred_12 obj_16)
       (pred_12 obj_31)
       (pred_12 obj_15)
       (pred_12 obj_30)
       (pred_12 obj_14)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_09)
       (pred_12 obj_27)
       (pred_12 obj_19)
       (pred_12 obj_20)
       (pred_12 obj_22)
       (pred_12 obj_05)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_24)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_29)
       (pred_5 obj_21)
       (pred_5 obj_25)
       (pred_5 obj_23)

       (pred_3 obj_28 obj_15)
       (pred_3 obj_28 obj_08)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_28)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_31 obj_07)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_30)
       (pred_3 obj_15 obj_28)
       (pred_3 obj_30 obj_12)
       (pred_3 obj_30 obj_14)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_30 obj_15)
       (pred_3 obj_14 obj_26)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_14 obj_30)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_31)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_12 obj_26)
       (pred_3 obj_12 obj_30)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_26 obj_27)
       (pred_3 obj_26 obj_10)
       (pred_3 obj_26 obj_14)
       (pred_3 obj_26 obj_12)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_26)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_03 obj_22)
       (pred_3 obj_03 obj_09)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_27)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_03)
       (pred_3 obj_27 obj_17)
       (pred_3 obj_27 obj_19)
       (pred_3 obj_27 obj_26)
       (pred_3 obj_27 obj_09)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_19 obj_27)
       (pred_3 obj_20 obj_24)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_22 obj_05)
       (pred_3 obj_22 obj_03)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_22)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_27)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_01 obj_24)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_24 obj_20)
       (pred_3 obj_24 obj_01)
       (pred_9 obj_20)
       (pred_9 obj_31)
       (pred_9 obj_10)
       (pred_1  obj_20 obj_02)
       (pred_1  obj_31 obj_04)
       (pred_1  obj_10 obj_29)
       (pred_4 obj_28)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_30)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_4 obj_12)
       (pred_4 obj_26)
       (pred_4 obj_06)
       (pred_4 obj_03)
       (pred_4 obj_09)
       (pred_4 obj_27)
       (pred_4 obj_19)
       (pred_4 obj_22)
       (pred_4 obj_05)
       (pred_4 obj_17)
       (pred_4 obj_01)
       (pred_4 obj_24)

       (pred_10  obj_21 obj_02)
       (pred_10  obj_25 obj_04)
       (pred_10  obj_23 obj_29)
       (pred_8 obj_21 obj_11)
       (pred_8 obj_25 obj_28)
       (pred_8 obj_23 obj_07)
       (pred_2 obj_13)
    )

    (:goal (and
       (pred_8 obj_21 obj_14)
       (pred_8 obj_23 obj_28)
    ))
(:constraints
  (always (not (pred_2 obj_16)))
)
)

; plan
1. (op_5 obj_13 obj_07)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_07)
   goals met: 0 of 2
2. (op_2 obj_07 obj_23)
   deleted: (pred_8 obj_23 obj_07) (pred_6)
   added: (pred_11 obj_23)
   goals met: 0 of 2
3. (op_5 obj_07 obj_13)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_13)
   goals met: 0 of 2
4. (op_5 obj_13 obj_14)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_14)
   goals met: 0 of 2
5. (op_5 obj_14 obj_11)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_11)
   goals met: 0 of 2
6. (op_3 obj_11 obj_21 obj_23)
   deleted: (pred_11 obj_23) (pred_8 obj_21 obj_11)
   added: (pred_11 obj_21) (pred_8 obj_23 obj_11)
   goals met: 0 of 2
7. (op_5 obj_11 obj_14)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_14)
   goals met: 0 of 2
8. (op_1 obj_14 obj_21)
   deleted: (pred_11 obj_21)
   added: (pred_6) (pred_8 obj_21 obj_14)
   goals met: 1 of 2
9. (op_5 obj_14 obj_11)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_11)
   goals met: 1 of 2
10. (op_2 obj_11 obj_23)
   deleted: (pred_8 obj_23 obj_11) (pred_6)
   added: (pred_11 obj_23)
   goals met: 1 of 2
11. (op_5 obj_11 obj_08)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_08)
   goals met: 1 of 2
12. (op_5 obj_08 obj_28)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_28)
   goals met: 1 of 2
13. (op_3 obj_28 obj_25 obj_23)
   deleted: (pred_11 obj_23) (pred_8 obj_25 obj_28)
   added: (pred_11 obj_25) (pred_8 obj_23 obj_28)
   goals met: 2 of 2
